{
    "career_history": [
        {
            "company": "John Deere",
            "location": "Remote",
            "duration": "Mar 2024 – Nov 2024",
            "title": "Senior Software Engineer",
            "responsibilities": [
                "Built frontend features for a provider portal using React + TypeScript with responsive, accessible UI (WCAG).",
                "Integrated React modules with Node.js/Hapi services and PostgreSQL backends for CRUD flows.",
                "Added Jest tests for core components and wired test runs into Jenkins to block unsafe merges.",
                "Partnered with DevOps to containerize select services in Docker and deploy on AWS (EC2/S3)."
            ]
        },
        {
            "company": "Blackline Safety",
            "location": "Remote",
            "duration": "May 2022 – Mar 2024",
            "title": "Senior Software Engineer",
            "responsibilities": [
                "Led parts of an Angular (v10+) rewrite for a real-time telemetry dashboard; standardized UI with component library theming.",
                "Built data processing with Node.js Lambdas on AWS (Lambda + API Gateway) into MongoDB/PostgreSQL stores.",
                "Maintained legacy integrations in PHP (Zend) and Python; refactored modules for readability and testability.",
                "Kept unit tests running in Jasmine/Karma and Pytest, enforced via GitHub Actions.",
                "Mentored junior engineers via code reviews and architecture walkthroughs."
            ]
        },
        {
            "company": "Facebook (Meta)",
            "location": "Remote",
            "duration": "Oct 2021 – Apr 2022",
            "title": "Software Engineer III (Contract)",
            "responsibilities": [
                "Delivered features for internal admin tools using React + GraphQL; collaborated on schema design and UI contracts.",
                "Consumed Hack (PHP variant) microservices; maintained strict typing and internal CI/testing standards.",
                "Documented reusable patterns for React hooks/state and shared them with adjacent teams."
            ]
        },
        {
            "company": "Wells Fargo",
            "location": "Remote",
            "duration": "Apr 2021 – Oct 2021",
            "title": "Software Engineer (Contract)",
            "responsibilities": [
                "Maintained UI for a Java-backed billing platform with JSP, jQuery, Bootstrap focusing on cross-browser performance.",
                "Automated key workflows with Selenium; collaborated on accessibility checks with internal tooling.",
                "Supported sprint planning, QA handoffs, and production hotfixes."
            ]
        },
        {
            "company": "Intuit",
            "location": "Remote",
            "duration": "Apr 2020 – Apr 2021",
            "title": "Software Engineer II (Contract)",
            "responsibilities": [
                "Built React + TypeScript and GraphQL features for QuickBooks web UI.",
                "Partnered with backend teams on schema design and endpoint contracts (validated via GraphiQL/Postman).",
                "Added Jest tests to critical modules and integrated with Jenkins for CI enforcement.",
                "Reviewed designs to ensure accessibility and faithful implementation."
            ]
        },
        {
            "company": "Walmart Labs",
            "location": "Sunnyvale, CA",
            "duration": "Sep 2019 – Apr 2020",
            "title": "Senior Software Engineer",
            "responsibilities": [
                "Delivered React/Redux modules for account management, integrating with Java/Spring REST services.",
                "Implemented consistent UI with Material UI, responsive breakpoints, and linting/formatting standards.",
                "Wrote Jest/Enzyme tests and worked with DevOps to include them in CI."
            ]
        },
        {
            "company": "Cisco",
            "location": "San Jose, CA",
            "duration": "Jun 2019 – Sep 2019",
            "title": "Senior Software Engineer",
            "responsibilities": [
                "Shipped React frontends for internal collaboration tools; wrote Jest/Enzyme unit tests.",
                "Built Node.js microservices that persisted analytics to MongoDB and surfaced data via Elasticsearch.",
                "Automated builds in Jenkins, produced Docker images, and coordinated deployments to AWS EC2."
            ]
        },
        {
            "company": "Guardian Alliance Technologies",
            "location": "Stockton, CA",
            "duration": "Sep 2017 – Apr 2019",
            "title": "Lead Software Engineer, Co-founder",
            "responsibilities": [
                "Co-architected a CJIS-aware SaaS using PHP (CodeIgniter) and Node.js with multi-tenant MySQL/PostgreSQL.",
                "Managed AWS GovCloud resources (EC2, RDS, S3) with least-privilege IAM; maintained audit logging.",
                "Implemented OWASP-aligned practices and prepared for FedRAMP-style reviews.",
                "Built Jenkins pipelines to run PHP/Node tests and ship containerized services (ECS where applicable).",
                "Led standups, reviews, and mentoring for a team of five."
            ]
        },
        {
            "company": "MindSlap",
            "location": "Stockton, CA",
            "duration": "Aug 2016 – Sep 2017",
            "title": "Lead Software Engineer",
            "responsibilities": [
                "Delivered client projects: React frontends, PHP (CodeIgniter) services, and WordPress-driven microsites.",
                "Created reusable components and integrated legacy jQuery plugins only where needed.",
                "Established Jest and PHPUnit suites and surfaced results in Jenkins."
            ]
        },
        {
            "company": "Zetta Inc.",
            "location": "Sunnyvale, CA",
            "duration": "Apr 2012 – Jul 2016",
            "title": "Senior Software Engineer",
            "responsibilities": [
                "Modernized legacy UI by moving from PHP templates to React and Backbone.",
                "Exposed data via PHP (Zend) REST APIs backed by MySQL/PostgreSQL.",
                "Authored Jenkins pipelines to build/test JS bundles and deploy to AWS S3/CloudFront.",
                "Introduced TDD practices and mentored junior developers."
            ]
        }
    ]
}
