{
    "career_history": [
        {
            "company": "John Deere",
            "location": "Iowa, USA (Remote)",
            "duration": "Mar 2024 – Nov 2024",
            "title": "Software Engineer",
            "responsibilities": [
                "Developed and deployed tools for large-scale landscaping providers, utilizing Google Maps, ReactJS, Node.js, Redux, and Hapi.js to create user-friendly interfaces for property management and crew scheduling.",
                "Implemented a feature allowing users to define and visualize property features, significantly improving the efficiency of landscaping operations.",
                "Optimized backend processes for crew and equipment management, resulting in a 15% reduction in processing time and enhanced data accuracy."
            ]
        },
        {
            "company": "Blackline Safety",
            "location": "Calgary, Alberta, Canada (Remote)",
            "duration": "May 2022 – Mar 2024",
            "title": "Software Engineer",
            "responsibilities": [
                "Engineered and maintained real-time communication systems using Node.js, Socket.io, and Express.js, enabling seamless interaction between off-site hardware and web services.",
                "Collaborated on multi-disciplinary projects utilizing Angular, Python, PHP (Zend Framework), and MySQL to deliver scalable solutions across various repositories.",
                "Deployed AWS Lambda functions for efficient serverless processing, improving data management and report generation by 20%."
            ]
        },
        {
            "company": "Facebook (Contingent Worker via Pyramid Consulting)",
            "location": "Remote",
            "duration": "Oct 2021 – Apr 2022",
            "title": "Software Engineer III",
            "responsibilities": [
                "Developed internal tools for file management and process automation using React.js, GraphQL via Relay.js, Flow.js, and PHP/HACK.",
                "Improved tooling efficiency by 25% by refactoring legacy code and optimizing workflows, resulting in better resource management and faster execution times."
            ]
        },
        {
            "company": "Cognizant",
            "location": "Remote",
            "duration": "Apr 2021 – Oct 2021",
            "title": "Software Engineer",
            "responsibilities": [
                "Contributed to the Investor Guidance Team at Wells Fargo, enhancing user experience and ADA compliance through jQuery and JAVA.",
                "Led the implementation of ADA features, ensuring the platform met regulatory standards and provided an inclusive user experience."
            ]
        },
        {
            "company": "Intuit (Contingent Worker via Pyramid Consulting)",
            "location": "Remote",
            "duration": "Apr 2020 – Apr 2021",
            "title": "Software Engineer II",
            "responsibilities": [
                "Played a key role in the QuickBooks ProAdvisor Accountant team, developing new features and components using ReactJS and GraphQL.",
                "Refactored legacy code into modern ReactJS components, improving code maintainability and reducing technical debt.",
                "Created comprehensive unit tests using Jest, ensuring high code quality and reliability."
            ]
        },
        {
            "company": "Walmart Labs (Contingent Worker via Pyramid Consulting)",
            "location": "Sunnyvale, CA",
            "duration": "Sep 2019 – Apr 2020",
            "title": "Senior Software Engineer & Developer",
            "responsibilities": [
                "Developed and maintained user account and transaction history features on Walmart.com using Hapi.js, Node.js, ReactJS, Redux, and GraphQL.",
                "Built end-to-end automation tests with Nightwatch.js, integrated into CI/CD pipelines using Jenkins, improving testing efficiency and reducing release cycle time.",
                "Enhanced frontend and proxy layer components, contributing to a more seamless user experience."
            ]
        },
        {
            "company": "Cisco",
            "location": "San Jose, CA",
            "duration": "Jun 2019 – Sep 2019",
            "title": "Senior Software Engineer & Developer",
            "responsibilities": [
                "Developed automated end-to-end testing suites using CodeCeptJS, improving testing coverage and reliability for internal tools.",
                "Enhanced client-facing tooling using NodeJS, ExpressJS, MongoDB, jQuery, ReactJS, and Redux, delivering new features and improving existing functionalities.",
                "Redeveloped middleware communication processes with Axios.js, optimizing server-client interactions and improving data transfer efficiency."
            ]
        },
        {
            "company": "Guardian Alliance Technologies",
            "location": "Stockton, CA",
            "duration": "Sep 2017 – Apr 2019",
            "title": "Lead & Senior Software Engineer Full Stack Developer",
            "responsibilities": [
                "Led the development of a FedRAMP-compliant SaaS application for background investigations in the public safety sector using CodeIgniter and Symfony PHP MVC frameworks.",
                "Managed parallel development teams, both local and offshore, as well as a QA team, ensuring timely delivery of high-quality software.",
                "Oversaw the services architecture, from server management to deployment, utilizing AWS EC2, S3, and Glacier for scalable infrastructure."
            ]
        },
        {
            "company": "MindSlap",
            "location": "Stockton, CA",
            "duration": "Aug 2016 – Sep 2017",
            "title": "Lead & Senior Software Engineer Full Stack Developer",
            "responsibilities": [
                "Led full-stack development projects across various platforms, enhancing and maintaining older systems using CodeIgniter, Zend Framework, and WordPress CMS.",
                "Managed AWS EC2 instances and DigitalOcean Droplets, ensuring reliable and scalable hosting environments for multiple client projects."
            ]
        },
        {
            "company": "Zetta Inc.",
            "location": "Sunnyvale, CA",
            "duration": "Apr 2012 – Jul 2016",
            "title": "Senior Software Engineer Full Stack",
            "responsibilities": [
                "Focused on frontend development, rebranding, and enhancing features of a cloud-based service in the Backup and Disaster Recovery sector.",
                "Primary stack included Zend Framework (PHP) and ReactJS, delivering reliable and user-friendly software solutions."
            ]
        }
    ]
}
